snlkuharlocal/src/DataProcessors/ПечатьЭтикетокЧЗ/ПечатьЭтикетокЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЭтикетокЧЗ</name>
  <attributes>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКодУпаковки</name>
  </attributes>
  <attributes>
    <name>ЗаменятьГС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКМ</name>
    <attributes>
      <name>ШтрихКодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура_Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель_Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПечатьЭтикетокЧЗ/ObjectModule.bsl
Перем CodeGenerator Экспорт;
Перем ММвВПикселе Экспорт;

Функция Печать(ДокОбъект, ДопПараметры = Неопределено) Экспорт	
	
	ДокСсылка = ДокОбъект.Ссылка;
	
	ПолучитьФорму("Форма").Открыть();

КонецФункции //Печать(ДокОбъект, ДопПараметры = Неопределено) Экспорт

#Область ПечатьDataMatrix

Функция СформироватьЭтикету(Макет, Выборка, Знач ДопПараметры = Неопределено) Экспорт
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	КорректировкаРазмераШрифта = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КорректировкаРазмераШрифта", 0);
	
	Область 			= Макет.ПолучитьОбласть("Товар|Колонка");	
	
	СтрокаКМ			= Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(Выборка.ЗначениеКМ); 
	ПоляШК 				= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоляШК_GS1(СтрокаКМ);
	
	//ВывестиШК(Область, "ШК_ДатаМатрикс", СформироватьКартинкуШК_DataMatrix(Символ(232)+СтрокаКМ));
	ВывестиШК(Область, "ШК_ДатаМатрикс", СформироватьКартинкуШК_DataMatrix(СтрокаКМ));
	
	ВыводитьЕАН13 = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВыводитьЕАН13", Ложь);
	
	Если ВыводитьЕАН13 Тогда
		Рис = Макет.Рисунки.ШК_ЕАН13;
		ВывестиШК(Область, "ШК_ЕАН13", СформироватьКартинкуШК_EAN(Прав(ПоляШК.ГТИН,13), Рис, КорректировкаРазмераШрифта));
	КонецЕсли; 
	
	Область.Параметры.Заполнить(Выборка);	
	Область.Параметры.Заполнить(ПоляШК);	
	Область.Параметры.Заполнить(ДопПараметры);
	
	
	Возврат Область;
КонецФункции //СформироватьЭтикетку(СтрокаКМ)

Функция СформироватьКА(Макет, КодАгрегации, НомерКоробки, КоличествоШтук, Выборка, Знач ДопПараметры = Неопределено) Экспорт
	если ДопПараметры=Неопределено и ТипЗнч(Выборка) = Тип("Структура") тогда
		ДопПараметры=Выборка;
	КонецЕсли;  
	
	//+++Чирков Д.С. 27.03.2026 MARK-3531 падает печать при пустых доп. параметрах
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	//---Чирков Д.С. 27.03.2026	
	
	// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
	ПечататьQR = Ложь;
	// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
	// Кухарь А.Ю. 01.05.2025 начало
	НужнаТолькоКартинка=ложь; 
	Если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда   
		если  ДопПараметры.Свойство("НужнаТолькоКартинка") тогда
			НужнаТолькоКартинка= ДопПараметры.НужнаТолькоКартинка;
		КонецЕсли;
		// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
		Если ДопПараметры.Свойство("ПечататьQR") Тогда
			ПечататьQR = ДопПараметры.ПечататьQR;
		КонецЕсли;
		// Смирнов М.Ю. 21.07.2025 HELP-5941 конец
	КонецЕсли;      
	если не НужнаТолькоКартинка тогда
		// Кухарь А.Ю. 01.05.2025 конец					
		ТипШК 		= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "ТипШК", Перечисления.ТипыШтрихКодов.Коробка);
		НомерБлочка	= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "НомерБлочка", 0);
		НомерПалеты	= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "НомерПалеты", 0);	
		
		Если ЗначениеЗаполнено(ТипШК) Тогда
			ИмяОбласти = "" + ТипШК;
		Иначе		
			ИмяОбласти = "Коробка";
		КонецЕсли;
		
		//++Данилова Е.В. 16.02.2026 SNL-138 		
		Если ДопПараметры.Свойство("ПечатьПоПНК") Тогда		
		
			ИмяОбласти = "КоробкаПНК";	
		
		КонецЕсли;
		//--Данилова Е.В. 16.02.2026 
		
		Область = Макет.ПолучитьОбласть(ИмяОбласти + "|Колонка");	
		// Кухарь А.Ю. 01.05.2025 начало
	КонецЕсли; 
	// Кухарь А.Ю. 01.05.2025 конец
	
	КорректировкаРазмераШрифта=0;
	
	ПрефиксШК="(00)";
	Если ДопПараметры.Свойство("БезПрефикса")
		И ДопПараметры.БезПрефикса = ИСТИНА Тогда	
		ПрефиксШК = ""; 		
	КонецЕсли;

	если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда
		если  ДопПараметры.Свойство("КорректировкаРазмераШрифта") тогда
			КорректировкаРазмераШрифта= ДопПараметры.КорректировкаРазмераШрифта;
		КонецЕсли;			
	
		                     
		ПрефиксКодаАгрегации="";	
		если  ДопПараметры.Свойство("ДобавлятьСкобочкиВТекст") тогда
			если ДопПараметры.ДобавлятьСкобочкиВТекст=Истина тогда
				ПрефиксКодаАгрегации="(00)";		
			КонецЕсли;
		КонецЕсли;
		ДопПараметры.вставить("ШтрихКод",ПрефиксКодаАгрегации+КодАгрегации);	
		
		если не НужнаТолькоКартинка тогда			
			область.параметры.заполнить(ДопПараметры);
		КонецЕсли; 
		
		если  ДопПараметры.Свойство("КорректировкаРазмераШрифта") тогда
			КорректировкаРазмераШрифта= ДопПараметры.КорректировкаРазмераШрифта;
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю. 25.03.2024 конец
	
	
	
	Рис 	= Неопределено;   
	
	// Кухарь А.Ю. 01.05.2025 начало  
	если НужнаТолькоКартинка Тогда   
		Возврат СформироватьКартинкуШК_EAN(ПрефиксШК+КодАгрегации, Рис,КорректировкаРазмераШрифта,ДопПараметры); 
	КонецЕсли;
	// Кухарь А.Ю. 01.05.2025 конец
	
	Для Каждого Рис Из Область.Рисунки Цикл
		Если СтрНачинаетсяС(Рис.Имя, "ШК_SSCC") Тогда Прервать КонецЕсли;	
	КонецЦикла; 
	Если Рис = Неопределено Тогда
		Сообщить("В макете не найдено рисунка ШК_SSCC !", СтатусСообщения.Важное);
	КонецЕсли;
	
	Если КодАгрегации = "9999" Тогда		
		Область.Рисунки.Удалить(Рис);
		Область.Параметры.НеполнаяКоробка = "INCOMPLETE BOX";
	ИначеЕсли ЗначениеЗаполнено(КодАгрегации) Тогда	
		// Кухарь А.Ю.  17.01.2025 начало
		//Картинка			= СформироватьКартинкуШК_EAN("00"+КодАгрегации, Рис,КорректировкаРазмераШрифта);
		// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
		Если ИмяОбласти = "Коробка" И ПечататьQR Тогда
			Картинка = 	СформироватьКартинкуШК_DataMatrix(ПрефиксШК+КодАгрегации);
		Иначе
			Картинка = СформироватьКартинкуШК_EAN(ПрефиксШК+КодАгрегации, Рис,КорректировкаРазмераШрифта,ДопПараметры);
			// Кухарь А.Ю.  17.01.2025 конец		
		КонецЕсли;
		ВывестиШК(Область, Рис.Имя, Картинка);
		// Смирнов М.Ю. 21.07.2025 HELP-5941 конец
	Иначе
		Область.Рисунки.Удалить(Рис);
		пОбласти = Новый Структура("НеполнаяКоробка", "NOT AGGREGATED");
		Область.Параметры.Заполнить(пОбласти);
	КонецЕсли;
	
	пОбласти = Новый Структура("НомерБлочка,НомерКоробки,НомерПалеты,КоличествоШтук", НомерБлочка, НомерКоробки, НомерПалеты,КоличествоШтук);
	ЗаполнитьЗначенияСвойств(Область.Параметры, пОбласти); 
	
	//++Данилова Е.В. 16.02.2025 HELP-2851 
	Если ДопПараметры.Свойство("Заголовок") Тогда	
		
		ЗаполнитьЗначенияСвойств(Область.Параметры, ДопПараметры); 
		
	КонецЕсли;
	//--Данилова Е.В. 16.02.2025
	

	
	Область.Параметры.Заполнить(Выборка);	
	
	Возврат Область;
КонецФункции //СформироватьКА(Макет, КодАгрегации, НомерКороба, КоличествоШтук, Выборка, УголПоворота = 0)

// Кухарь А.Ю.  21.01.2025 начало
//  Функция СформироватьКА_БезНоменклатуры(Макет, КодАгрегации) Экспорт
Функция СформироватьКА_БезНоменклатуры(Макет, КодАгрегации, ДопПараметры=Неопределено) Экспорт 
	// Кухарь А.Ю.  21.01.2025 конец
	
	
	
	Область = Макет.ПолучитьОбласть("Коробка|Колонка");		
	Рис 	= Область.Рисунки.ШК_SSCC;	
	
	// Кухарь А.Ю.  21.01.2025 начало
	// Кухарь А.Ю.  24.01.2025 начало
	//По просьбе Алексея Петрова сделал для всех макетов
	//Префикс="00";
	Префикс="(00)";
	// Кухарь А.Ю.  24.01.2025 конец

	если ТипЗнч(ДопПараметры)=Тип("Структура") тогда
		//если ДопПараметры.свойство("ДобавлятьСкобки") тогда
		//	Если ДопПараметры.ДобавлятьСкобки тогда
		//		Префикс = "(00)";
		//	КонецЕсли;
		//КонецЕсли;
		// Кухарь А.Ю.  12.02.2025 начало
		// HELP-2858
		ДопПараметры.вставить("ШтрихКод",КодАгрегации);
		//ПрефиксКодаАгрегации="(00)";	
		//если  ДопПараметры.Свойство("АгрегацииВCode128") тогда
		//	если ДопПараметры.АгрегацииВCode128=Истина тогда
		//		ПрефиксКодаАгрегации="";		
		//	КонецЕсли;
		//КонецЕсли;
		//ДопПараметры.вставить("ШтрихКод",ПрефиксКодаАгрегации+КодАгрегации);		 
		// Кухарь А.Ю.  12.02.2025 конец

		область.параметры.заполнить(ДопПараметры);	
	КонецЕсли;
	// Кухарь А.Ю.  21.01.2025 конец
	
	// Кухарь А.Ю.  21.01.2025 начало
	// Картинка = СформироватьКартинкуШК_EAN("00"+КодАгрегации, Рис);	
	Картинка = СформироватьКартинкуШК_EAN(Префикс+КодАгрегации, Рис, ,ДопПараметры);	 
	// Кухарь А.Ю.  21.01.2025 конец
	
	ВывестиШК(Область, "ШК_SSCC", Картинка);
	
	Возврат Область;
КонецФункции //СформироватьКА(Макет, КодАгрегации, НомерКороба, КоличествоШтук, Выборка, УголПоворота = 0)

Процедура ВывестиШК(Область, ИмяРисунка, Картинка)	
	Рис 				= Область.Рисунки[ИмяРисунка];
	
	Рис.РазмерКартинки	= РазмерКартинки.Пропорционально;
	Рис.Линия			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
	Рис.Картинка 		= Картинка;
КонецПроцедуры //ВывестиШК(Область, ИмяРисунка, Картинка)

// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
Процедура ВывестиШКРамка(Область, ИмяРисунка, Картинка)	
	Рис 				= Область.Рисунки[ИмяРисунка];
	Рис.РазмерКартинки	= РазмерКартинки.Пропорционально;
	Рис.Линия			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная);
	Рис.Картинка 		= Картинка;
КонецПроцедуры
// Смирнов М.Ю. 21.07.2025 HELP-5941 конец

Функция СформироватьКартинкуШК_DataMatrix(Знач ШтрихКод)    
	
	ПараметрыШтрихкода = ПараметрыГенерацииШКпоУмолчанию();
	ПараметрыШтрихкода.ТипВходныхДанных = 1; // Тип входных данных (0-Строка, 1-Base64).
	 
	ПараметрыШтрихкода.ТипКода	= 24; //24(тип кода - GS1 databar extended stacked), [с версии 9.0.2.2],
	ПараметрыШтрихкода.Штрихкод	= Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ШтрихКод));
    
    РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШтрихкода);
 
    Если НЕ РезультатШтрихкод.Успешно Тогда
        Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
    КонецЕсли;
 
    Возврат РезультатШтрихкод.Картинка;
 
КонецФункции

Функция СформироватьКартинкуШК_EAN(Знач ШтрихКод, Рис, КорректировкаРазмераШрифта = 0,ДопПараметры=Неопределено)    
	Если ММвВПикселе = Неопределено Тогда
		ЗаполнитьММвВПикселе();	
	КонецЕсли; 
	
	ПараметрыШК = ПараметрыГенерацииШКпоУмолчанию();	
	
	ПараметрыШК.ТипКода			= 2;
	
	// Кухарь А.Ю. 01.05.2025 начало     
	НужнаТолькоКартинка=ложь;
	Если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда   
		если  ДопПараметры.Свойство("НужнаТолькоКартинка") тогда
			НужнаТолькоКартинка = ДопПараметры.НужнаТолькоКартинка;	
		КонецЕсли;
	КонецЕсли;	      
	если НужнаТолькоКартинка тогда   
		К = 150/Мин(ДопПараметры.ВысотаРисунка,ДопПараметры.ШиринаРисунка);	 
		мВысота = Окр(К * ДопПараметры.ВысотаРисунка / ММвВПикселе);
		мШирина = Окр(К * ДопПараметры.ШиринаРисунка/ ММвВПикселе);
	иначе
		К = 150/Мин(Рис.Высота,Рис.Ширина);		    
		мВысота = Окр(К * Рис.Высота / ММвВПикселе);
		мШирина = Окр(К * Рис.Ширина / ММвВПикселе);
	КонецЕсли;
	// Кухарь А.Ю. 01.05.2025 конец
	
	

	
	
	
	УголПоворота	= ?(мВысота>мШирина, 90, 0);
	
	ПараметрыШК.Высота			= мВысота;
	ПараметрыШК.Ширина			= мШирина;	
	
	ПараметрыШК.ОтображатьТекст = Истина;
	
	
	ПараметрыШК.УголПоворота	= УголПоворота;
	
	// Кухарь А.Ю. 25.03.2024 начало
	если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда
		если  ДопПараметры.Свойство("ОтображатьТекст") тогда
			ПараметрыШК.ОтображатьТекст=ДопПараметры.ОтображатьТекст;
		КонецЕсли;			
	КонецЕсли;
	// Кухарь А.Ю. 25.03.2024 конец
	
	ПараметрыШК.РазмерШрифта	= Цел(12*К) + КорректировкаРазмераШрифта;	
	ПараметрыШК.Штрихкод		= ШтрихКод;	
	
	если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда
		Если ДопПараметры.Свойство("АгрегацииВCode128") тогда
			Если ДопПараметры.АгрегацииВCode128 тогда
				ПараметрыШК.ТипКода			= 4;
				ПараметрыШК.Штрихкод		= СтрЗаменить(ШтрихКод,"(00)","");
				//ПараметрыШК.Текст			= Сред(ШтрихКод,3);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
    РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШК);
	
    Если НЕ РезультатШтрихкод.Успешно Тогда
        Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
    КонецЕсли;
 
    Возврат РезультатШтрихкод.Картинка;
 
КонецФункции

Функция ПодготовитьИзображениеШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода)
	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
				Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
			ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПараметрыГенерацииШКпоУмолчанию() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция КомпонентаФормированияDataMatrixКода() Экспорт
	Если CodeGenerator<>Неопределено Тогда
		Возврат CodeGenerator;	
	КонецЕсли; 
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации DataMatrix-кода.'");
	
	CodeGenerator = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	Если CodeGenerator = Неопределено Тогда 
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
	Возврат CodeGenerator;	
КонецФункции

Процедура ЗаполнитьММвВПикселе()

	Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;

КонецПроцедуры
 

#КонецОбласти

Функция ПечатьКодовАгрегаций(КодыАгрегаций, ИмяМакета, фСохранятьВPDF, АгрегацииВCode128 = Ложь) Экспорт	
	Части = СтрРазделить(ИмяМакета,"_");
	
	ШиринаСтраницы = Число(Части[0]);
	ВысотаСтраницы = Число(Части[1]);
	
	ТД = Новый ТабличныйДокумент;
	Если НЕ фСохранятьВPDF Тогда
		ТД.ИмяПараметровПечати	= "ПараметрыПечати_Этикетки_DataMatrix" + ИмяМакета;					
	КонецЕсли;
	
	ТД.ПолеСверху	= 0.0;
	ТД.ПолеСнизу 	= 0.0;
	ТД.ПолеСправа 	= 0.0;
	ТД.ПолеСлева 	= 0.0;
	
	ТД.ШиринаСтраницы = ШиринаСтраницы;
	ТД.ВысотаСтраницы = ВысотаСтраницы;
	
	Макет	= ПолучитьМакет("Этикетка_" + ИмяМакета);
	
	ВсегоСтрок = КодыАгрегаций.Количество();
	Сч = 0;
	
	// Кухарь А.Ю.  21.01.2025 начало
	//
	ДопПараметры=новый Структура();
	если СтрНайти(ИмяМакета,"45_30")> 0 тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина);
		ДопПараметры.Вставить("ОтображатьТекст",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  21.01.2025 конец
	
	// Кухарь А.Ю.  29.01.2025 начало
	если СтрНайти(ИмяМакета,"25_25")> 0  тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина);
		ДопПараметры.Вставить("ОтображатьТекст",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  29.01.2025 конец
	
	//Валетов + 07,02,25 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1355
	Если СтрНайти(ИмяМакета,"100_50")> 0 ИЛИ АгрегацииВCode128 Тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина); 
		//Валетов + 23,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3433
		Если СтрНайти(ИмяМакета,"100_50")> 0 Тогда
			ДопПараметры.Вставить("ОтображатьТекст",Ложь);
		Иначе
			ДопПараметры.Вставить("ОтображатьТекст",Истина); 
		КонецЕсли;
		//Валетов -
		ДопПараметры.Вставить("АгрегацииВCode128",АгрегацииВCode128);
	КонецЕсли;
	
	Для Каждого КодАгрегации Из КодыАгрегаций Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		// Кухарь А.Ю.  21.01.2025 начало
		//ТД.Вывести(СформироватьКА_БезНоменклатуры(Макет, КодАгрегации));
		ТД.Вывести(СформироватьКА_БезНоменклатуры(Макет, КодАгрегации,ДопПараметры));	 
		// Кухарь А.Ю.  21.01.2025 конец
		
		Если фСохранятьВPDF Тогда
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		Сч = Сч + 1;
		Состояние_("Вывод: " + (ВсегоСтрок - Сч));
	КонецЦикла; 	
	Состояние_("");
	
	Возврат ТД;
КонецФункции //ПечатьКодовКоробок(СписокКодов, ИмяМакета, фСохранятьВPDF)
 
Функция Состояние_(Строка)
	#ЕСЛИ КЛИЕНТ ТОГДА
		Состояние(Строка);	
	#КОНЕЦЕСЛИ
КонецФункции // ()
